In [2]:
#importing the pandas
import pandas as pd

In [5]:
# creating the data frame from list 
li = ["Om" ,"Ambadas ", "Bade"]
df= pd.DataFrame(li)

# creating the dataframe from dict 
data = {
    "name" :["om","ram", "sham","vikas"],
    "marks" :[1,2,3,4]
}
df =pd.DataFrame(data)
df

    name  marks
0     om      1
1    ram      2
2   sham      3
3  vikas      4

In [10]:
data = {
    "name" :["om","ram", "sham","vikas"],
    "marks" :[1,2,3,4] ,
    "std" :[1,2,4,5]
}
# convert the dict into dataframe 
df =pd.DataFrame(data)
# to select only two coloumb
print(df[["name","std"]])
df.rename(columns= {"name":"Name"},inplace=True)

    name  std
0     om    1
1    ram    2
2   sham    4
3  vikas    5

In [12]:
df

    Name  marks  std
0     om      1    1
1    ram      2    2
2   sham      3    4
3  vikas      4    5